---
layout: page
permalink: /josm-gpx-upload/
title: "آپلود gpx در josm"
description: آپلود gpx در josm 
category: 'learnosm'
tags:
- osm
- learnosm
image: "/assets/img/osmedit.png"
---

# آپلود gpx در josm


قبلاً در مورد اهمیت و ضرورت آپلود کردن فایلهای gpx در OSM، بحث شده. 
همه‌ی ما میدونیم که فایلهای gpxای که تهیه میکنیم خارج از اشکال نیست و قسمت‌هایی داره که احتمالاً ما دوست نداریم آپلودشون کنیم ولی بدلیل قسمت‌های خوب و درستی که داره اون قسمتهای مشکل دار رو نادیده میگیریم و کُل اون فایل رو آپلود میکنیم...
این قسمت‌های اشکال دار به مرور زمان و با انباشته شدن روی هم، علاوه بر اینکه وجهه‌ی بدی ایجاد میکنه میتونه باعث کم شدن اعتبار کُل فایلهای gpx آپلود شده در اون مکان بشه...
اما چاره چیه و چیکار باید کرد؟ ما خیلی راحت میتونیم بوسیله‌ی همین josm قسمت‌های مشکل دار یک فایل gpx رو جدا و بعد اقدام به آپلود کردن اون فایل بکنیم.
چجوری؟ به ترتیب زیر...
فایل gpx رو با josm باز کنین، در قسمت layers روی لایه gpx راست کلیک کنین و گزینه‌ی convert_to_data_layer رو انتخاب کنین (با این کار فایل gpx شما به یک خط خام تبدیل میشه)، قسمت‌های مشکل دار رو از خط خام بوجود اومده حذف کنین، دوباره در قسمت layers روی لایه‌ی مربوطه کلیک راست کنین و این بار گزینه‌ی convert_to_gpx_layer رو انتخاب کنین، سپس از سربرگهای بالای صفحه GPS و سپس Upload_Traces رو انتخاب کنین...
خیلی دقت کنین که کُل مراحل بالا در یک لایه‌ی جداگانه انجام بشه. (وقتی دارین این عملیات رو روی یک فایل gpx انجام میدین بهتره هیچ دیتایی دیگه‌ای رو از سرور OSM دانلود نکرده باشین و صرفاً josm رو برای انجام این کار باز کرده باشین و پس از انجام عملیات هم josm رو ببندین) 
نکته: برای اینکه شما بتونین یک فایل gpx رو از طریق josm آپلود کنین باید از قبل پلاگین DirectUpload رو دانلود، نصب و راه‌اندازی کرده باشین.
